Tekla.Structures.Geometry3d.Parallel
The Parallel class contains methods for testing the parallelism of geometric objects.

Tekla.Structures.Geometry3d.Parallel.VectorToVector(Tekla.Structures.Geometry3d.Vector,Tekla.Structures.Geometry3d.Vector)
Returns true if the given vectors are parallel.
Vector1: The first vector to be used.
Vector2: The second vector to be used.
Returns: True if the given vectors are parallel.

Tekla.Structures.Geometry3d.Parallel.VectorToVector(Tekla.Structures.Geometry3d.Vector,Tekla.Structures.Geometry3d.Vector,System.Double)
Returns true if the given vectors are parallel within the given angular tolerance.
Vector1: The first vector to be used.
Vector2: The second vector to be used.
Tolerance: The angular tolerance (in radians) to be used.
Returns: True if the given vectors are parallel within the given tolerance.

Tekla.Structures.Geometry3d.Parallel.LineToLine(Tekla.Structures.Geometry3d.Line,Tekla.Structures.Geometry3d.Line)
Returns true if the given lines are parallel.
Line1: The first line to be used.
Line2: The second line to be used.
Returns: True if the given lines are parallel.

Tekla.Structures.Geometry3d.Parallel.LineToLine(Tekla.Structures.Geometry3d.Line,Tekla.Structures.Geometry3d.Line,System.Double)
Returns true if the given lines are parallel within the given angular tolerance.
Line1: The first line to be used.
Line2: The second line to be used.
Tolerance: The angular tolerance (in radians) to be used.
Returns: True if the given lines are parallel within the given tolerance.

Tekla.Structures.Geometry3d.Parallel.LineSegmentToLineSegment(Tekla.Structures.Geometry3d.LineSegment,Tekla.Structures.Geometry3d.LineSegment)
Returns true if the given line segments are parallel.
LineSegment1: The first line segment to be used.
LineSegment2: The second line segment to be used.
Returns: True if the given line segments are parallel.

Tekla.Structures.Geometry3d.Parallel.LineSegmentToLineSegment(Tekla.Structures.Geometry3d.LineSegment,Tekla.Structures.Geometry3d.LineSegment,System.Double)
Returns true if the given line segments are parallel within the given angular tolerance.
LineSegment1: The first line segment to be used.
LineSegment2: The second line segment to be used.
Tolerance: The angular tolerance (in radians) to be used.
Returns: True if the given line segments are parallel within the given tolerance.

Tekla.Structures.Geometry3d.Parallel.PlaneToPlane(Tekla.Structures.Geometry3d.GeometricPlane,Tekla.Structures.Geometry3d.GeometricPlane)
Returns true if the given planes are parallel.
Plane1: The first plane to be used.
Plane2: The second plane to be used.
Returns: True if the given planes are parallel.

Tekla.Structures.Geometry3d.Parallel.PlaneToPlane(Tekla.Structures.Geometry3d.GeometricPlane,Tekla.Structures.Geometry3d.GeometricPlane,System.Double)
Returns true if the given planes are parallel within the given angular tolerance.
Plane1: The first plane to be used.
Plane2: The second plane to be used.
Tolerance: The angular tolerance (in radians) to be used.
Returns: True if the given planes are parallel within the given tolerance.

Tekla.Structures.Geometry3d.Parallel.VectorToPlane(Tekla.Structures.Geometry3d.Vector,Tekla.Structures.Geometry3d.GeometricPlane)
Returns true if the given vector and plane are parallel.
Vector: The vector to be used.
Plane: The plane to be used.
Returns: True if the given vector and plane are parallel.

Tekla.Structures.Geometry3d.Parallel.VectorToPlane(Tekla.Structures.Geometry3d.Vector,Tekla.Structures.Geometry3d.GeometricPlane,System.Double)
Returns true if the given vector and plane are parallel within the given angular tolerance.
Vector: The vector to be used.
Plane: The plane to be used.
Tolerance: The angular tolerance (in radians) to be used.
Returns: True if the given vector and plane are parallel within the given tolerance.

Tekla.Structures.Geometry3d.Parallel.LineToPlane(Tekla.Structures.Geometry3d.Line,Tekla.Structures.Geometry3d.GeometricPlane)
Returns true if the given line and plane are parallel.
Line: The line to be used.
Plane: The plane to be used.
Returns: True if the given line and plane are parallel.

Tekla.Structures.Geometry3d.Parallel.LineToPlane(Tekla.Structures.Geometry3d.Line,Tekla.Structures.Geometry3d.GeometricPlane,System.Double)
Returns true if the given line and plane are parallel within the given angular tolerance.
Line: The line to be used.
Plane: The plane to be used.
Tolerance: The angular tolerance (in radians) to be used.
Returns: True if the given line and plane are parallel within the given tolerance.

Tekla.Structures.Geometry3d.Parallel.LineSegmentToPlane(Tekla.Structures.Geometry3d.LineSegment,Tekla.Structures.Geometry3d.GeometricPlane)
Returns true if the given line segment and plane are parallel.
LineSegment: The line segment to be used.
Plane: The plane to be used.
Returns: True if the given line segment and plane are parallel.

Tekla.Structures.Geometry3d.Parallel.LineSegmentToPlane(Tekla.Structures.Geometry3d.LineSegment,Tekla.Structures.Geometry3d.GeometricPlane,System.Double)
Returns true if the given line segment and plane are parallel within the given angular tolerance.
LineSegment: The line segment to be used.
Plane: The plane to be used.
Tolerance: The angular tolerance (in radians) to be used.
Returns: True if the given line segment and plane are parallel within the given tolerance.